In [ ]:
     #############    ##########    Data Manipulation in Pandas    ##########     #############

In [ ]:
         ###########    ##########   Grouping data in Pandas   ##########   #############
    
 =>  Groupby is a pretty simple concept. 
 
 =>  We can create a grouping of categories and apply a function to the categories.

 =>  Groupby mainly refers to a process involving one or more of the following steps they are:

    *  Splitting : It is a process in which we split data into group by applying some conditions on datasets.

    *  Applying : It is a process in which we apply a function to each group independently

    *  Combining : It is a process in which we combine different datasets after applying groupby and results 
                     into a data structure

In [ ]:
        ###########    ########## Splitting Data into groups  ##########   #############
  
 =>  Splitting is a process in which we split data into a group by applying some conditions on datasets.
       
 =>  In order to split the data, we apply certain conditions on datasets. 
      
 =>  In order to split the data, we use groupby() function this function is used to split the data into groups
        based on some criteria.
        
 =>  Pandas objects can be split on any of their axes. 
  
 =>  The abstract definition of grouping is to provide a mapping of labels to group names.
 
 =>  Pandas datasets can be split into any of their objects. There are multiple ways to split data like:

         *  obj.groupby(key)

         *  obj.groupby(key, axis=1)

         *  obj.groupby([key1, key2])

In [ ]:
   ###########   #########  Grouping data with one key   ###########    ############

 =>  In order to group data with one key, we pass only one key as an argument in groupby function.

In [1]:
# importing pandas module 
import pandas as pd 

# Define a dictionary containing employee data 
data1 = {'Name':['Jai', 'Anuj', 'Jai', 'Princi', 
				'Gaurav', 'Anuj', 'Princi', 'Abhi'], 
		'Age':[27, 24, 22, 32, 
			33, 36, 27, 32], 
		'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj', 
				'Jaunpur', 'Kanpur', 'Allahabad', 'Aligarh'], 
		'Qualification':['Msc', 'MA', 'MCA', 'Phd', 
						'B.Tech', 'B.com', 'Msc', 'MA']} 
	

# Convert the dictionary into DataFrame 
df = pd.DataFrame(data1) 

print(df) 

print ("\n")

# using groupby function with one key 

df.groupby('Name') 
print(df.groupby('Name').groups) 

print ("\n")
# applying groupby() function to 
# group the data on Name value. 
gk = df.groupby('Name') 
	
# Let's print the first entries 
# in all the groups formed. 
gk.first()

     Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc
1    Anuj   24     Kanpur            MA
2     Jai   22  Allahabad           MCA
3  Princi   32    Kannuaj           Phd
4  Gaurav   33    Jaunpur        B.Tech
5    Anuj   36     Kanpur         B.com
6  Princi   27  Allahabad           Msc
7    Abhi   32    Aligarh            MA


{'Abhi': Int64Index([7], dtype='int64'), 'Anuj': Int64Index([1, 5], dtype='int64'), 'Gaurav': Int64Index([4], dtype='int64'), 'Jai': Int64Index([0, 2], dtype='int64'), 'Princi': Int64Index([3, 6], dtype='int64')}

        Age  Address Qualification
Name
Abhi     32  Aligarh            MA
Anuj     24   Kanpur            MA
Gaurav   33  Jaunpur        B.Tech
Jai      27   Nagpur           Msc
Princi   32  Kannuaj           Phd

In [ ]:
         ###########   #########  Grouping data with multiple keys   ###########    ############
    
 =>  In order to group data with multiple keys, we pass multiple keys in groupby function.

In [ ]:
# importing pandas module 
import pandas as pd 

# Define a dictionary containing employee data 
data1 = {'Name':['Jai', 'Anuj', 'Jai', 'Princi', 
				'Gaurav', 'Anuj', 'Princi', 'Abhi'], 
		'Age':[27, 24, 22, 32, 
			33, 36, 27, 32], 
		'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj', 
				'Jaunpur', 'Kanpur', 'Allahabad', 'Aligarh'], 
		'Qualification':['Msc', 'MA', 'MCA', 'Phd', 
						'B.Tech', 'B.com', 'Msc', 'MA']} 
	

# Convert the dictionary into DataFrame 
df = pd.DataFrame(data1) 

print(df) 
print ('\n')

# Now we group a data of “Name” and “Qualification” together using multiple keys in groupby function.
df.groupby(['Name', 'Qualification']) 

print(df.groupby(['Name', 'Qualification']).groups)

In [ ]:
###########   #########  Grouping data by sorting keys   ###########    ############
    
 =>  Group keys are sorted by default uring the groupby operation. User can pass sort=False for potential speedups.

In [2]:
# importing pandas module 
import pandas as pd 

# Define a dictionary containing employee data 
data1 = {'Name':['Jai', 'Anuj', 'Jai', 'Princi', 
				'Gaurav', 'Anuj', 'Princi', 'Abhi'], 
		'Age':[27, 24, 22, 32, 
			33, 36, 27, 32], } 
	

# Convert the dictionary into DataFrame 
df = pd.DataFrame(data1) 

print(df)

     Name  Age
0     Jai   27
1    Anuj   24
2     Jai   22
3  Princi   32
4  Gaurav   33
5    Anuj   36
6  Princi   27
7    Abhi   32

In [3]:
# using groupby function 
# without using sort 

df.groupby(['Name']).sum()

        Age
Name
Abhi     32
Anuj     60
Gaurav   33
Jai      49
Princi   59

In [4]:
# Now we apply groupby() using sort in order to attain potential speedups 

df.groupby(['Name'], sort = False).sum()

        Age
Name
Jai      49
Anuj     60
Princi   59
Gaurav   33
Abhi     32

In [ ]:
      ###########   #########  Grouping data with object attributes   ###########    ############
 
=>  Groups attribute is like dictionary whose keys are the computed unique groups and corresponding 
         values being the axis labels belonging to each group.

In [5]:
# importing pandas module 
import pandas as pd 

# Define a dictionary containing employee data 
data1 = {'Name':['Jai', 'Anuj', 'Jai', 'Princi', 
				'Gaurav', 'Anuj', 'Princi', 'Abhi'], 
		'Age':[27, 24, 22, 32, 
			33, 36, 27, 32], 
		'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj', 
				'Jaunpur', 'Kanpur', 'Allahabad', 'Aligarh'], 
		'Qualification':['Msc', 'MA', 'MCA', 'Phd', 
						'B.Tech', 'B.com', 'Msc', 'MA']} 
	

# Convert the dictionary into DataFrame 
df = pd.DataFrame(data1) 

print(df) 
print ('\n')

#  Now we group data like we do in a dictionary using keys.

df.groupby('Name').groups

     Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc
1    Anuj   24     Kanpur            MA
2     Jai   22  Allahabad           MCA
3  Princi   32    Kannuaj           Phd
4  Gaurav   33    Jaunpur        B.Tech
5    Anuj   36     Kanpur         B.com
6  Princi   27  Allahabad           Msc
7    Abhi   32    Aligarh            MA

{'Abhi': Int64Index([7], dtype='int64'),
 'Anuj': Int64Index([1, 5], dtype='int64'),
 'Gaurav': Int64Index([4], dtype='int64'),
 'Jai': Int64Index([0, 2], dtype='int64'),
 'Princi': Int64Index([3, 6], dtype='int64')}

In [ ]:
     #############   ##########   Itterating Through groups    ###########   #############
    
 =>  In order to iterate an element of groups, we can iterate through the object similar to itertools.obj.

In [6]:
# importing pandas module 
import pandas as pd 

# Define a dictionary containing employee data 
data1 = {'Name':['Jai', 'Anuj', 'Jai', 'Princi', 
				'Gaurav', 'Anuj', 'Princi', 'Abhi'], 
		'Age':[27, 24, 22, 32, 
			33, 36, 27, 32], 
		'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj', 
				'Jaunpur', 'Kanpur', 'Allahabad', 'Aligarh'], 
		'Qualification':['Msc', 'MA', 'MCA', 'Phd', 
						'B.Tech', 'B.com', 'Msc', 'MA']} 
	

# Convert the dictionary into DataFrame 
df = pd.DataFrame(data1) 

print(df)

     Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc
1    Anuj   24     Kanpur            MA
2     Jai   22  Allahabad           MCA
3  Princi   32    Kannuaj           Phd
4  Gaurav   33    Jaunpur        B.Tech
5    Anuj   36     Kanpur         B.com
6  Princi   27  Allahabad           Msc
7    Abhi   32    Aligarh            MA

In [ ]:
=>  Now we iterate an element of group in a similar way we do in itertools.obj.

In [7]:
# iterating an element 
# of group 

grp = df.groupby('Name') 
for name, group in grp: 
	print(name) 
	print(group) 
	print()

Abhi
   Name  Age  Address Qualification
7  Abhi   32  Aligarh            MA

Anuj
   Name  Age Address Qualification
1  Anuj   24  Kanpur            MA
5  Anuj   36  Kanpur         B.com

Gaurav
     Name  Age  Address Qualification
4  Gaurav   33  Jaunpur        B.Tech

Jai
  Name  Age    Address Qualification
0  Jai   27     Nagpur           Msc
2  Jai   22  Allahabad           MCA

Princi
     Name  Age    Address Qualification
3  Princi   32    Kannuaj           Phd
6  Princi   27  Allahabad           Msc

In [ ]:
=>  Now we iterate an element of group containing multiple keys

In [8]:
# iterating an element 
# of group containing 
# multiple keys 

grp = df.groupby(['Name', 'Qualification']) 
for name, group in grp: 
	print(name) 
	print(group) 
	print()

('Abhi', 'MA')
   Name  Age  Address Qualification
7  Abhi   32  Aligarh            MA

('Anuj', 'B.com')
   Name  Age Address Qualification
5  Anuj   36  Kanpur         B.com

('Anuj', 'MA')
   Name  Age Address Qualification
1  Anuj   24  Kanpur            MA

('Gaurav', 'B.Tech')
     Name  Age  Address Qualification
4  Gaurav   33  Jaunpur        B.Tech

('Jai', 'MCA')
  Name  Age    Address Qualification
2  Jai   22  Allahabad           MCA

('Jai', 'Msc')
  Name  Age Address Qualification
0  Jai   27  Nagpur           Msc

('Princi', 'Msc')
     Name  Age    Address Qualification
6  Princi   27  Allahabad           Msc

('Princi', 'Phd')
     Name  Age  Address Qualification
3  Princi   32  Kannuaj           Phd

In [ ]:
     ###############    ##########   selecting a group  ###########    ##############
    
 =>  In order to select a group, we can select group using GroupBy.get_group().
    
 =>  We can select a group by applying a function GroupBy.get_group this function select a single group.

In [ ]:
# importing pandas module 
import pandas as pd 

# Define a dictionary containing employee data 
data1 = {'Name':['Jai', 'Anuj', 'Jai', 'Princi', 
				'Gaurav', 'Anuj', 'Princi', 'Abhi'], 
		'Age':[27, 24, 22, 32, 
			33, 36, 27, 32], 
		'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj', 
				'Jaunpur', 'Kanpur', 'Allahabad', 'Aligarh'], 
		'Qualification':['Msc', 'MA', 'MCA', 'Phd', 
						'B.Tech', 'B.com', 'Msc', 'MA']} 
	

# Convert the dictionary into DataFrame 
df = pd.DataFrame(data1) 

print(df) 
print ('\n')

# Now we select a single group using Groupby.get_group.
# selecting a single group 

grp = df.groupby('Name') 
grp.get_group('Jai')

In [9]:
# selecting object grouped on multiple columns 

grp = df.groupby(['Name', 'Qualification']) 
grp.get_group(('Jai', 'Msc'))

  Name  Age Address Qualification
0  Jai   27  Nagpur           Msc

In [ ]:
     ##########    ##########    Applying Functions to group   ##########    ############
      
 =>  After splitting a data into a group, we apply a function to each group in order to do that 
          we perform some operation they are:
        
      *  Aggregation : It is a process in which we compute a summary statistic (or statistics) about each group. 
                            For Example, Compute group sums or means.
            
      *  Transformation : It is a process in which we perform some group-specific computations and return 
                              a like-indexed.  
                           For Example, Filling NAs within groups with a value derived from each group
            
      *  Filtration : It is a process in which we discard some groups, according to a group-wise computation  
                         that evaluates True or False.  
                           For Example, Filtering out data based on the group sum or mean

In [ ]:
      ##########    ##########    Aggregation function  ##########    ############

 =>  Aggregation is a process in which we compute a summary statistic about each group. 

 =>  Aggregated function returns a single aggregated value for each group. 
    
 =>  After splitting a data into groups using groupby function, several aggregation operations can be performed
           on the grouped data.

In [10]:
# importing pandas module 
import pandas as pd 

# importing numpy as np 
import numpy as np 

# Define a dictionary containing employee data 
data1 = {'Name':['Jai', 'Anuj', 'Jai', 'Princi', 
				'Gaurav', 'Anuj', 'Princi', 'Abhi'], 
		'Age':[27, 24, 22, 32, 
			33, 36, 27, 32], 
		'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj', 
				'Jaunpur', 'Kanpur', 'Allahabad', 'Aligarh'], 
		'Qualification':['Msc', 'MA', 'MCA', 'Phd', 
						'B.Tech', 'B.com', 'Msc', 'MA']} 
	

# Convert the dictionary into DataFrame 
df = pd.DataFrame(data1) 

print(df) 
print ("\n")

# performing aggregation using 
# aggregate method 

grp1 = df.groupby('Name') 

grp1.aggregate(np.sum)

     Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc
1    Anuj   24     Kanpur            MA
2     Jai   22  Allahabad           MCA
3  Princi   32    Kannuaj           Phd
4  Gaurav   33    Jaunpur        B.Tech
5    Anuj   36     Kanpur         B.com
6  Princi   27  Allahabad           Msc
7    Abhi   32    Aligarh            MA

        Age
Name
Abhi     32
Anuj     60
Gaurav   33
Jai      49
Princi   59

In [11]:
# performing aggregation on 
# group containing multiple 
# keys 
grp1 = df.groupby(['Name', 'Qualification']) 

grp1.aggregate(np.sum)

                      Age
Name   Qualification
Abhi   MA              32
Anuj   B.com           36
       MA              24
Gaurav B.Tech          33
Jai    MCA             22
       Msc             27
Princi Msc             27
       Phd             32

In [12]:
# applying multiple function by passing 
# a list of functions 

grp = df.groupby('Name') 

grp['Age'].agg([np.sum, np.mean, np.std])

        sum  mean       std
Name
Abhi     32  32.0       NaN
Anuj     60  30.0  8.485281
Gaurav   33  33.0       NaN
Jai      49  24.5  3.535534
Princi   59  29.5  3.535534

In [ ]:
 * Applying different functions to DataFrame columns -

 =>  In order to apply a different aggregation to the columns of a DataFrame, we can pass a dictionary
       to aggregate .

In [13]:
# importing pandas module 
import pandas as pd 

# importing numpy as np 
import numpy as np 

# Define a dictionary containing employee data 
data1 = {'Name':['Jai', 'Anuj', 'Jai', 'Princi', 
				'Gaurav', 'Anuj', 'Princi', 'Abhi'], 
		'Age':[27, 24, 22, 32, 
			33, 36, 27, 32], 
		'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj', 
				'Jaunpur', 'Kanpur', 'Allahabad', 'Aligarh'], 
		'Qualification':['Msc', 'MA', 'MCA', 'Phd', 
						'B.Tech', 'B.com', 'Msc', 'MA'], 
		'Score': [23, 34, 35, 45, 47, 50, 52, 53]} 
	

# Convert the dictionary into DataFrame 
df = pd.DataFrame(data1) 

print(df) 
print ("\n")
 
#  Now we apply a different aggregation to the columns of a dataframe.
# using different aggregation 
# function by passing dictionary 
# to aggregate 
grp = df.groupby('Name') 

grp.agg({'Age' : 'sum', 'Score' : 'std'})

     Name  Age    Address Qualification  Score
0     Jai   27     Nagpur           Msc     23
1    Anuj   24     Kanpur            MA     34
2     Jai   22  Allahabad           MCA     35
3  Princi   32    Kannuaj           Phd     45
4  Gaurav   33    Jaunpur        B.Tech     47
5    Anuj   36     Kanpur         B.com     50
6  Princi   27  Allahabad           Msc     52
7    Abhi   32    Aligarh            MA     53

        Age      Score
Name
Abhi     32        NaN
Anuj     60  11.313708
Gaurav   33        NaN
Jai      49   8.485281
Princi   59   4.949747

In [ ]:
     ##########    ##########    Transformation function  ##########    ############

 =>  Transformation is a process in which we perform some group-specific computations and return a like-indexed. 

 =>  Transform method returns an object that is indexed the same (same size) as the one being grouped.  
    
 =>  The transform function must:

          * Return a result that is either the same size as the group chunk
          * Operate column-by-column on the group chunk
          * Not perform in-place operations on the group chunk.

In [14]:
# importing pandas module 
import pandas as pd 

# importing numpy as np 
import numpy as np 

# Define a dictionary containing employee data 
data1 = {'Name':['Jai', 'Anuj', 'Jai', 'Princi', 
				'Gaurav', 'Anuj', 'Princi', 'Abhi'], 
		'Age':[27, 24, 22, 32, 
			33, 36, 27, 32], 
		'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj', 
				'Jaunpur', 'Kanpur', 'Allahabad', 'Aligarh'], 
		'Qualification':['Msc', 'MA', 'MCA', 'Phd', 
						'B.Tech', 'B.com', 'Msc', 'MA'], 
		'Score': [23, 34, 35, 45, 47, 50, 52, 53]} 
	

# Convert the dictionary into DataFrame 
df = pd.DataFrame(data1) 

print(df) 
print ("\n")

#  Now we perform some group-specific computations and return a like-indexed.
# using transform function 
grp = df.groupby('Name') 
sc = lambda x: (x - x.mean()) / x.std()*10
grp.transform(sc)

     Name  Age    Address Qualification  Score
0     Jai   27     Nagpur           Msc     23
1    Anuj   24     Kanpur            MA     34
2     Jai   22  Allahabad           MCA     35
3  Princi   32    Kannuaj           Phd     45
4  Gaurav   33    Jaunpur        B.Tech     47
5    Anuj   36     Kanpur         B.com     50
6  Princi   27  Allahabad           Msc     52
7    Abhi   32    Aligarh            MA     53

        Age     Score
0  7.071068 -7.071068
1 -7.071068 -7.071068
2 -7.071068  7.071068
3  7.071068 -7.071068
4       NaN       NaN
5  7.071068  7.071068
6 -7.071068  7.071068
7       NaN       NaN

In [ ]:
      ##########    ##########    Filteration  function  ##########    ############

 =>  Filtration is a process in which we discard some groups, according to a group-wise computation 
          that evaluates True or False.  
    
 =>  In order to filter a group, we use filter method and apply some condition by which we filter group.

In [16]:
# importing pandas module 
import pandas as pd 

# importing numpy as np 
import numpy as np 

# Define a dictionary containing employee data 
data1 = {'Name':['Jai', 'Anuj', 'Jai', 'Princi', 
				'Gaurav', 'Anuj', 'Princi', 'Abhi'], 
		'Age':[27, 24, 22, 32, 
			33, 36, 27, 32], 
		'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj', 
				'Jaunpur', 'Kanpur', 'Allahabad', 'Aligarh'], 
		'Qualification':['Msc', 'MA', 'MCA', 'Phd', 
						'B.Tech', 'B.com', 'Msc', 'MA'], 
		'Score': [23, 34, 35, 45, 47, 50, 52, 53]} 
	

# Convert the dictionary into DataFrame 
df = pd.DataFrame(data1) 

print(df) 
print ("\n")

 #  Now we filter data that to return the Name which have lived two or more times .

grp = df.groupby('Name') 
grp.filter(lambda x: len(x) >= 2)

     Name  Age    Address Qualification  Score
0     Jai   27     Nagpur           Msc     23
1    Anuj   24     Kanpur            MA     34
2     Jai   22  Allahabad           MCA     35
3  Princi   32    Kannuaj           Phd     45
4  Gaurav   33    Jaunpur        B.Tech     47
5    Anuj   36     Kanpur         B.com     50
6  Princi   27  Allahabad           Msc     52
7    Abhi   32    Aligarh            MA     53

     Name  Age    Address Qualification  Score
0     Jai   27     Nagpur           Msc     23
1    Anuj   24     Kanpur            MA     34
2     Jai   22  Allahabad           MCA     35
3  Princi   32    Kannuaj           Phd     45
5    Anuj   36     Kanpur         B.com     50
6  Princi   27  Allahabad           Msc     52

In [ ]:
        ################     ##########   Grouping Rows in pandas    ############    ###############
    
 =>  Create a dataframe first.
 
 =>  Now, create a grouping object, means an object that represents that particular grouping.

In [17]:
# importing Pandas 
import pandas as pd 

# example dataframe 
example = {'Team':['Arsenal', 'Manchester United', 'Arsenal', 
				'Arsenal', 'Chelsea', 'Manchester United', 
				'Manchester United', 'Chelsea', 'Chelsea', 'Chelsea'], 
					
		'Player':['Ozil', 'Pogba', 'Lucas', 'Aubameyang', 
					'Hazard', 'Mata', 'Lukaku', 'Morata', 
										'Giroud', 'Kante'], 
										
		'Goals':[5, 3, 6, 4, 9, 2, 0, 5, 2, 3] } 

df = pd.DataFrame(example) 

print(df) 
print ("\n")

#  create a grouping object, means an object that represents that particular grouping.
total_goals = df['Goals'].groupby(df['Team']) 

# printing the means value 
print(total_goals.mean())

                Team      Player  Goals
0            Arsenal        Ozil      5
1  Manchester United       Pogba      3
2            Arsenal       Lucas      6
3            Arsenal  Aubameyang      4
4            Chelsea      Hazard      9
5  Manchester United        Mata      2
6  Manchester United      Lukaku      0
7            Chelsea      Morata      5
8            Chelsea      Giroud      2
9            Chelsea       Kante      3


Team
Arsenal              5.000000
Chelsea              4.750000
Manchester United    1.666667
Name: Goals, dtype: float64

In [18]:
#  Example 2

import pandas as pd 

# example dataframe 
example = {'Team':['Australia', 'England', 'South Africa', 
				'Australia', 'England', 'India', 'India', 
						'South Africa', 'England', 'India'], 
						
		'Player':['Ricky Ponting', 'Joe Root', 'Hashim Amla', 
					'David Warner', 'Jos Buttler', 'Virat Kohli', 
					'Rohit Sharma', 'David Miller', 'Eoin Morgan', 
												'Dinesh Karthik'], 
												
		'Runs':[345, 336, 689, 490, 989, 672, 560, 455, 342, 376], 
			
		'Salary':[34500, 33600, 68900, 49000, 98899, 
					67562, 56760, 45675, 34542, 31176] } 

df = pd.DataFrame(example) 

total_salary = df['Salary'].groupby(df['Team']) 

# printing the means value 
print(total_salary.mean())

Team
Australia       41750.000000
England         55680.333333
India           51832.666667
South Africa    57287.500000
Name: Salary, dtype: float64

In [19]:
#    ############   ####  Combining multiple columns in Pandas groupby with dictionary   ########    #########
    
# importing pandas as pd  
import pandas as pd  
  
# Creating a dictionary  
d = {'id':['1', '2', '3'], 
     'Column 1.1':[14, 15, 16], 
     'Column 1.2':[10, 10, 10], 
     'Column 1.3':[1, 4, 5], 
     'Column 2.1':[1, 2, 3], 
     'Column 2.2':[10, 10, 10], } 
  
# Converting dictionary into a data-frame  
df = pd.DataFrame(d) 
print(df) 
print (*"\n")

# Creating the groupby dictionary  
groupby_dict = {'Column 1.1':'Column 1', 
                'Column 1.2':'Column 1', 
                'Column 1.3':'Column 1', 
                'Column 2.1':'Column 2', 
                'Column 2.2':'Column 2' } 
  
# Set the index of df as Column 'id' 
df = df.set_index('id') 
  
# Groupby the groupby_dict created above  
df = df.groupby(groupby_dict, axis = 1).min() 
print(df)

  id  Column 1.1  Column 1.2  Column 1.3  Column 2.1  Column 2.2
0  1          14          10           1           1          10
1  2          15          10           4           2          10
2  3          16          10           5           3          10


    Column 1  Column 2
id
1          1         1
2          4         2
3          5         3

In [ ]:
   *    Explanation

 =>  Here we have grouped Column 1.1, Column 1.2 and Column 1.3 into Column 1 
           and Column 2.1, Column 2.2 into Column 2.

 =>  Notice that the output in each column is the min value of each row of the columns grouped together.  
           i.e in Column 1, value of first row is the minimum value of Column 1.1 Row 1,
                 Column 1.2 Row 1 and Column 1.3 Row 1.